[
    {
        "name": "Apple-Black Rot",
        "info": "Circular, sunken lesions on fruit, causing rot and mummification.",
        "cause": "Fungus Botryosphaeria obtusa.",
        "cure": "Apply fungicides before flowering, remove infected fruit, and practice good orchard hygiene.",
        "products": "Fungicides: Captan, Mancozeb, Thiophanate-methyl."
    },
    {
        "name": "Apple-Cedar / Apple Rust",
        "info": "Rust-colored spots on leaves, leading to premature defoliation and reduced fruit yield.",
        "cause": "Fungus Gymnosporangium juniperi-virginianae.",
        "cure": "Prune nearby juniper trees, apply fungicides, and plant resistant apple varieties.",
        "products": "Fungicides: Myclobutanil, Propiconazole, Thiophanate-methyl"
    },
    {
        "name": "Apple-Healthy",
        "info": "Lush foliage, healthy fruit development, and optimal yield.",
        "cause": "Proper orchard management, disease-resistant cultivars, and favorable environmental conditions.",
        "cure": "Regular monitoring for pests and diseases, proper pruning, and maintaining orchard cleanliness.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Apple-Scab",
        "info": "Dark, scabby lesions on leaves and fruit, leading to defoliation and reduced yield.",
        "cause": "Fungus Venturia inaequalis.",
        "cure": "Apply fungicides preventively, prune infected branches, and practice orchard sanitation.",
        "products": "Fungicides: Captan, Mancozeb, Thiophanate-methyl."
    },
    {
        "name": "Cherry-Healthy",
        "info": "Vibrant green foliage, vigorous growth, and abundant fruit set.",
        "cause": "Adequate sunlight, balanced nutrition, and disease-resistant cultivars.",
        "cure": "Regular pruning to improve air circulation, proper irrigation, and monitoring for pests and diseases.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Powdery Mildew",
        "info": "White powdery patches on leaves and fruit, leading to leaf distortion and reduced yield.",
        "cause": "Fungus Podosphaera clandestina.",
        "cure": "Apply fungicides preventively, prune affected branches, and improve orchard airflow to reduce humidity.",
        "products": "Fungicides: Sulfur, Myclobutanil, Potassium bicarbonate."
    },
    {
        "name": "Corn-Cercospora Leaf Spot / Gray Leaf Spot",
        "info": "Grayish lesions with brown borders on leaves, reducing photosynthesis.",
        "cause": "Fungus Cercospora zeae-maydis.",
        "cure": "Plant resistant varieties, rotate crops, use fungicides early in the season.",
        "products": "Fungicides: Azoxystrobin, Pyraclostrobin, Propiconazole."
    },
    {
        "name": "Corn-Common Rust",
        "info": "Orange to reddish-brown pustules on leaves, affecting nutrient absorption.",
        "cause": "Fungus Puccinia sorghi.",
        "cure": "Plant rust-resistant corn hybrids, apply fungicides if infection becomes severe.",
        "products": "Fungicides: Azoxystrobin, Pyraclostrobin, Propiconazole."
    },
    {
        "name": "Corn-Healthy",
        "info": "Strong stalks, dark green leaves, and uniform ear development.",
        "cause": "Balanced soil fertility, proper irrigation, and planting disease-resistant varieties.",
        "cure": "Regular monitoring for pests and diseases, timely weed control, and maintaining optimal plant density.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Corn-Northern Leaf Blight",
        "info": "Irregularly shaped lesions with tan centers on leaves, reducing photosynthesis.",
        "cause": "Fungus Exserohilum turcicum.",
        "cure": "Plant resistant hybrids, use fungicides preventively, practice crop rotation.",
        "products": "Fungicides: Azoxystrobin, Pyraclostrobin, Propiconazole."
    },
    {
        "name": "Grape-Black Rot",
        "info": "Brown lesions on leaves and fruit, causing decay and shriveling.",
        "cause": "Fungus Guignardia bidwellii.",
        "cure": "Apply fungicides before bloom, prune for better airflow, and remove infected plant debris.",
        "products": "Fungicides: Captan, Mancozeb, Myclobutanil."
    },
    {
        "name": "Grape-Esca / Black Measles",
        "info": "Yellowing between leaf veins, internal wood necrosis, and leaf malformation.",
        "cause": "Complex of fungi including Phaeoacremonium spp. and Phaeomoniella chlamydospora.",
        "cure": "Prune infected wood, use trunk protectants, and plant resistant varieties.",
        "products": "Fungicides: Propiconazole, Thiophanate-methyl, Boscalid."
    },
    {
        "name": "Grape-Healthy",
        "info": "Vigorous vines, lush green foliage, and abundant fruit clusters.",
        "cause": "Proper vineyard management, disease-resistant cultivars, and favorable growing conditions.",
        "cure": "Regular monitoring for pests and diseases, adequate pruning, and maintaining vineyard sanitation.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Grape-Leaf Blight / Isariopsis Leaf Spot",
        "info": "Circular brown lesions on leaves, reducing photosynthesis.",
        "cause": "Fungus Isariopsis griseola.",
        "cure": "Apply fungicides preventively, prune for better airflow, and remove infected plant material.",
        "products": "Fungicides: Mancozeb, Copper-based fungicides, Myclobutanil."
    },
    {
        "name": "Peach-Bacterial Spot",
        "info": "Dark brown lesions on leaves and fruit, leading to defoliation and reduced yield.",
        "cause": "Bacterium Xanthomonas arboricola pv. pruni.",
        "cure": "Apply copper-based bactericides, prune infected branches, and practice orchard sanitation.",
        "products": "Bactericides: Copper-based bactericides, Streptomycin."
    },
    {
        "name": "Peach-Healthy",
        "info": "Lush foliage, vigorous growth, and abundant fruit set.",
        "cause": "Proper orchard management, disease-resistant cultivars, and optimal growing conditions.",
        "cure": "Regular monitoring for pests and diseases, proper pruning, and maintaining orchard cleanliness.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Pepper-Bacterial Spot",
        "info": "Circular, water-soaked lesions on leaves and fruit, leading to defoliation and reduced yield.",
        "cause": "Bacterium Xanthomonas campestris pv. vesicatoria.",
        "cure": "Apply copper-based bactericides, practice crop rotation, and remove infected plant debris.",
        "products": "Bactericides: Copper-based bactericides, Streptomycin."
    },
    {
        "name": "Pepper-Healthy",
        "info": "Dark green foliage, sturdy stems, and abundant fruit production.",
        "cause": "Proper care, disease-resistant varieties, and suitable growing conditions.",
        "cure": "Regular monitoring for pests and diseases, balanced nutrition, and timely watering.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Potato-Early Blight",
        "info": "Brown lesions on lower leaves, leading to premature defoliation.",
        "cause": "Fungus Alternaria solani.",
        "cure": "Apply fungicides preventively, practice crop rotation, and remove infected plant debris.",
        "products": "Fungicides: Chlorothalonil, Mancozeb, Propiconazole."
    },
    {
        "name": "Potato-Healthy",
        "info": "Vibrant green foliage, robust stems, and abundant tuber production.",
        "cause": "Optimal growing conditions, disease-resistant cultivars, and proper field management.",
        "cure": "Regular monitoring for pests and diseases, balanced fertilization, and adequate irrigation.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Potato-Late Blight",
        "info": "Dark lesions on leaves, leading to rapid defoliation and tuber rot.",
        "cause": "Fungus Phytophthora infestans.",
        "cure": "Apply fungicides preventively, practice good ventilation, and remove infected plant material promptly.",
        "products": "Fungicides: Chlorothalonil, Mancozeb, Metalaxyl."
    },
    {
        "name": "Rice-Brown Spot",
        "info": "Brown spots on rice leaves, affecting photosynthesis.",
        "cause": "Fungal pathogen Bipolaris oryzae.",
        "cure": "Use fungicides early in infection stages, ensure proper drainage, and maintain field hygiene.",
        "products": "Fungicides: Tricyclazole, Azoxystrobin, Propiconazole."
    },
    {
        "name": "Rice-Healthy",
        "info": "Flourishing rice plants with vibrant green leaves and strong stems.",
        "cause": "Proper cultivation practices, good soil fertility, and adequate water management.",
        "cure": "Regular monitoring for pest or disease outbreaks and timely intervention.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Rice-Hispa",
        "info": "Feeding damage causes white or transparent patches on leaves, reducing yield.",
        "cause": "Infestation by rice hispa insect (Dicladispa armigera).",
        "cure": "Use insecticides like chlorpyrifos, apply biological control agents, and practice integrated pest management.",
        "products": "Insecticides: Chlorpyrifos, Carbaryl, Thiamethoxam."
    },
    {
        "name": "Rice-Leaf Blast",
        "info": "Circular lesions with gray centers on rice leaves, leading to yield loss.",
        "cause": "Fungus Magnaporthe oryzae.",
        "cure": "Apply fungicides at early infection stages, cultivate blast-resistant rice varieties, and ensure proper field drainage.",
        "products": "Fungicides: Tricyclazole, Azoxystrobin, Propiconazole."
    },
    {
        "name": "Strawberry-Healthy",
        "info": "Lush green foliage, vigorous growth, and abundant fruit production.",
        "cause": "Ideal growing conditions, disease-resistant cultivars, and proper care.",
        "cure": "Regular irrigation, weed control, and monitoring for pests and diseases.",
        "products": "Use Organic fertilizer, proper irrigation, pruning, and weed control are essential."
    },
    {
        "name": "Strawberry-Leaf Scorch",
        "info": "Reddish-brown lesions on leaf margins, leading to leaf drying and reduced yield.",
        "cause": "Fungus Diplocarpon earlianum.",
        "cure": "Apply fungicides preventively, remove infected leaves, and maintain good air circulation around plants.",
        "products": "Fungicides: Tricyclazole, Azoxystrobin, Propiconazole."
    }
]